{
  "name": "Baked Apple Turnovers",
  "slug": "baked-apple-turnovers",
  "description": "Oh so good! Better than store-bought, these can be prepared in advance and frozen. Simply freeze uncooked on a Sheet Pan; once frozen, place in freezer bags and bake when ready.",
  "ingredients": [
    {
      "name": "apples",
      "quantity": "2",
      "additionalInstruction": "peeled, cored, and cut into small pieces"
    },
    {
      "name": "Baked Apple Sweet Dip Mix or Apple Pie Spice",
      "quantity": "1 - 2 tsp",
      "additionalInstruction": null
    },
    {
      "name": "square puff pastry",
      "quantity": "1 pkg (8 oz/250 g)",
      "additionalInstruction": "defrosted "
    },
    {
      "name": "milk",
      "quantity": "2 tbsp",
      "additionalInstruction": "optional"
    }
  ],
  "totalTime": "28 min",
  "servings": "10 servings",
  "preparation": [
    "Preheat oven to 425° F (220° C).",
    "Combine apple and spice in a Rectangular Steamer. Cover and microwave for 3 minutes on high. Let cool uncovered.",
    "Roll 1 piece of pastry into a thin 10.5” square. Gently flip onto large side of an Appy Maker. Using a rolling pin, firmly roll over to cut pastry.",
    "Add 1 tbsp of apple mixture to the centre of each triangle.",
    "Take out second piece of puff pastry, roll, and layer on top. Using a rolling pin, gently but firmly roll over to seal pockets and cut pastry.",
    "Gently remove each stuffed triangle from the Appy Maker and place on a Sheet Pan lined with a Sheet Pan Liner.",
    "Brush with milk, if desired, and bake for 15 min or until golden brown. Cool on a wire rack and enjoy!"
  ],
  "tags": [
    {
      "slug": "dessert",
      "name": "Dessert"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "1 turnover",
    "calories": 160,
    "fat": 10,
    "saturatedFat": 2.5,
    "transFat": 0,
    "cholesterol": 0,
    "sodium": 65,
    "carbohydrate": 17,
    "fiber": 1,
    "sugars": 5,
    "protein": 2
  },
  "tips": [],
  "perfectlyBalanceYourPlate": "",
  "image": "Baked-Apple-Turnovers-Main.jpg",
  "thumbnail": "Baked-Apple-Turnovers-Main.webp",
  "products": [
    {
      "slug": "apple_pie_spice",
      "name": "Apple Pie Spice",
      "summary": [
        "Move over pumpkin spice; it's time for Apple Pie Spice to shine! Perfect for leveling up the taste of fall-inspired baking, it's also great on top of oatmeal, in a frothy late or smoothie – or anywhere you want a punch of apple pie flavour.&nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_liner__1716111_",
      "name": "Sheet Pan Liner",
      "summary": [
        "Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"
      ]
    }
  ]
}