{
  "name": "Blueberry Lime Ice Box Cake ",
  "slug": "blueberry-lime-ice-box-cake",
  "description": "This summer, we’re throwing it back to an oldie but goodie. Ice box cakes are trending! Graham crackers, sweet cream, and blueberry sauce transform into thin and airy layers of cake, no baking required! Prep it ahead and keep frozen until ready to serve. Make sure to let the cake thaw out a bit before serving—you want soft layers that you can easily slice through.",
  "ingredients": [
    {
      "name": "Berry Swirl No-Bake Cheesecake Mix",
      "quantity": "1 pkg",
      "additionalInstruction": null
    },
    {
      "name": "fresh or frozen blueberries",
      "quantity": "2 cups",
      "additionalInstruction": null
    },
    {
      "name": "whipping cream ",
      "quantity": "1 <sup>1</sup>&frasl;<sub>2</sub> cups",
      "additionalInstruction": null
    },
    {
      "name": "lime",
      "quantity": "1",
      "additionalInstruction": null
    },
    {
      "name": "graham cracker wafers",
      "quantity": "6",
      "additionalInstruction": null
    }
  ],
  "totalTime": "4 hrs & 20 min (includes 4 hrs freeze time)",
  "servings": "8 servings",
  "preparation": [
    "In a microwaveable bowl, combine half the mix with blueberries; stir to combine. Microwave, uncovered, 1 min 30 sec or until hot. Mash and stir together; set aside in the fridge.",
    "Line Rectangular Steamer with plastic wrap—you’ll need two large pieces, so it covers the bottom and comes up and over the side.",
    "In a large bowl, add cream and remaining mix. Zest lime and add 1 tsp to bowl. Squeeze in 1 tbsp juice from lime. Beat on medium-high speed until soft peaks form, about 2–3 min.",
    "To make the cake, you will be assembling three layers of wafers, three layers of whipped cream, and two layers of blueberry sauce.",
    "Spread 1 tbsp whipped cream in a very thin layer on the bottom of the steamer. Cover the bottom with 2 wafers (this layer might only need 1 1&frasl;2 wafers), breaking them to fit in a single layer.",
    "Spread out 1&frasl;3 of the whipped cream overtop the wafers. Add half the blueberry sauce over top, spreading out evenly. Add a second layer of whipped cream, a second layer of wafers, and the remaining sauce. Top with a third layer of wafers and a third layer of whipped cream. Top with additional blueberries and lime zest, if desired.",
    "Loosely cover with the overhanging plastic wrap and place in freezer at least 4 hrs or overnight.",
    "Before serving, allow cake to soften in the refrigerator 1 hr, or at room temperature about 10 min. Remove cake from pan and unwrap plastic. Cut into slices and serve cold."
  ],
  "tags": [
    {
      "slug": "dessert",
      "name": "Dessert"
    },
    {
      "slug": "low_sodium",
      "name": "Low-sodium"
    },
    {
      "slug": "easter",
      "name": "Easter"
    },
    {
      "slug": "birthday",
      "name": "Birthday"
    },
    {
      "slug": "sugar_conscious",
      "name": "Sugar Conscious"
    },
    {
      "slug": "onion_free",
      "name": "Onion-free"
    },
    {
      "slug": "mother_s_day",
      "name": "Mother’s Day"
    },
    {
      "slug": "no_cook",
      "name": "No-Cook"
    },
    {
      "slug": "vegetarian",
      "name": "Vegetarian"
    },
    {
      "slug": "canada_day",
      "name": "Canada Day"
    },
    {
      "slug": "better_than_take_out",
      "name": "Better Than Takeout"
    },
    {
      "slug": "n4th_of_july",
      "name": "Independence Day"
    },
    {
      "slug": "garlic_free",
      "name": "Garlic-free"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "",
    "calories": 260,
    "fat": 16,
    "saturatedFat": 9,
    "transFat": 0,
    "cholesterol": 50,
    "sodium": 85,
    "carbohydrate": 28,
    "fiber": 1,
    "sugars": null,
    "protein": 2
  },
  "tips": [
    "To easily zest a lime without a zester simply peel the lime (making sure to leave the white pith behind) and finely chop the peel with a knife."
  ],
  "perfectlyBalanceYourPlate": "",
  "image": "blueberry_lime_icebox_cake_1036x583.jpg",
  "thumbnail": "blueberry_lime_icebox_cake_1036x583.webp",
  "products": [
    {
      "slug": "berry_swirl_cheesecake_mix__pack_of_2_",
      "name": "Berry Swirl Cheesecake Mix (Pack of 2)",
      "summary": [
        "When the summer temperatures start to rise, keep your kitchen cool and enjoy the best no-bake cheesecake around! Easily whip up cheesecake, icebox cakes, ice pops, tarts and more, packed with the taste of vine-ripened, juicy berries.&nbsp;&nbsp;"
      ]
    },
    {
      "slug": "rectangular_steamer_efd7225",
      "name": "Rectangular Steamer",
      "summary": [
        "Easy to clean. Easy to serve. Rectangular, silicone steamer is perfect for side dishes &amp; desserts."
      ]
    }
  ]
}