{
  "name": "Cheesy Brussels Sprouts",
  "slug": "cheesy-brussels-sprouts",
  "description": "Say cheese! These Brussels sprouts will please the pickiest eaters. This recipe is a delicious way to get your greens, whether you’re entertaining some special guests or simply preparing dinner on a regular night.",
  "ingredients": [
    {
      "name": "Brussels sprouts",
      "quantity": "1 lb (450 g)",
      "additionalInstruction": null
    },
    {
      "name": "red onion",
      "quantity": "1 small",
      "additionalInstruction": null
    },
    {
      "name": "olive oil",
      "quantity": "2 tbsp",
      "additionalInstruction": null
    },
    {
      "name": "Cheesy Fries Seasoning or CCB Dip Mix, divided",
      "quantity": "2 tbsp",
      "additionalInstruction": "divided"
    }
  ],
  "totalTime": "25 min",
  "servings": "4 servings",
  "preparation": [
    "Preheat oven to 425° F. Line Sheet Pan with Sheet Pan Liner.",
    "Trim stem ends and discard any damaged outer leaves from sprouts. Cut sprouts lengthwise into halves. Thinly slice onion. Arrange sprout halves and onion slices on pan.",
    "Drizzle with oil and sprinkle with 1 tbsp seasoning. Toss to evenly coat.",
    "Roast for 20 min, or until sprouts are crispy around edges and just tender. Remove from oven and shake on remaining seasoning."
  ],
  "tags": [
    {
      "slug": "low_sodium",
      "name": "Low-sodium"
    },
    {
      "slug": "sugar_conscious",
      "name": "Sugar Conscious"
    },
    {
      "slug": "one_dish",
      "name": "One Dish"
    },
    {
      "slug": "vegetarian",
      "name": "Vegetarian"
    },
    {
      "slug": "gluten_free_e8446d0",
      "name": "Gluten-free"
    },
    {
      "slug": "cook_the_catalogue",
      "name": "Cook the Catalogue"
    },
    {
      "slug": "thanksgiving",
      "name": "Thanksgiving"
    },
    {
      "slug": "sheet_pan_3e5bebd",
      "name": "Sheet Pan"
    },
    {
      "slug": "sides",
      "name": "Side Dishes"
    },
    {
      "slug": "new_year_s_eve",
      "name": "New Year’s Eve"
    },
    {
      "slug": "christmas",
      "name": "Christmas"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "",
    "calories": 130,
    "fat": 8,
    "saturatedFat": 1.5,
    "transFat": 0,
    "cholesterol": 5,
    "sodium": 330,
    "carbohydrate": 13,
    "fiber": 5,
    "sugars": 4,
    "protein": 5
  },
  "tips": [
    "Not feeling sprouts? Swap in broccoli or cauliflower florets.",
    "Feeling spicy? Swap 1–2 tbsp Cajun Fries Seasoning for Cheesy Fries Seasoning."
  ],
  "perfectlyBalanceYourPlate": "Serve with 4 oz (113 g) lean protein and 1 cup mashed potatoes.",
  "image": "cheesy_brussel_sprouts_1036x583.jpg",
  "thumbnail": "cheesy_brussel_sprouts_1036x583.webp",
  "products": [
    {
      "slug": "roasted_garlic_parmesan_fries_seasoning",
      "name": "Cheesy Fries Seasoning",
      "summary": [
        "Who can resist restaurant-style cheesy fries? They’re even better when we bake them at home. Made with aromatic garlic, real Parmesan, and premium quality spices, this versatile seasoning is low in sodium, and free from gluten, artificial flavours, colours, and preservatives. Simply sprinkle it on fries, popcorn, pasta, or veggies for a healthy, cheesy family favourite.&nbsp;"
      ]
    },
    {
      "slug": "ccb_dip_mix_b61a530",
      "name": "CCB Dip Mix",
      "summary": [
        "<strong>Cheese. Chives. Bacon. </strong>How's that for a totally irresistible trio? Our very own smoky vegetarian bacon, made from pinto beans, is the secret star of this oh-so-yummy dip.",
        "This blend is all about versatility and we recommend taking it way beyond the dip bowl—use CCB in any dish that could use a little levelling up.&nbsp;",
        "<br>"
      ]
    },
    {
      "slug": "sheet_pan_423693c",
      "name": "Sheet Pan",
      "summary": [
        "Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_liner__1716111_",
      "name": "Sheet Pan Liner",
      "summary": [
        "Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"
      ]
    },
    {
      "slug": "cajun_fries_seasoning",
      "name": "Cajun Fries Seasoning",
      "summary": [
        "We love to make our taste buds dance with this <strong>Cajun Fries Seasoning</strong>. This blend of premium herbs and spices creates an earthy, piquant flavour that tastes great and packs a punch. It's perfect for anyone who wants to add excitement and heat to their favourite snack. Sprinkle as much or as little as you like over your spuds for a healthy alternative to restaurant fries with added seasonings.&nbsp;"
      ]
    }
  ]
}