{
  "name": "Dirt & Worms",
  "slug": "dirt-worms",
  "description": "Here’s our version of this fun ‘n silly dessert! We’ve swapped pudding for protein-packed Greek yogurt—feel free to jazz it up with Summer Berry Sweet Dip or cocoa powder (see Tips). Make the top layer extra “dirty” by adding crushed cookies. It’s the ultimate kid’s party treat! Let them assemble their own cups. Using leftover cake or doing a bit of prep ahead of time, you can whip this up in under 10 min.",
  "ingredients": [
    {
      "name": "Chocolate Cake Mix",
      "quantity": "1 pkg",
      "additionalInstruction": null
    },
    {
      "name": "egg",
      "quantity": "1",
      "additionalInstruction": null
    },
    {
      "name": " milk",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": "your choice"
    },
    {
      "name": "oil",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "vanilla extract",
      "quantity": "1 tsp",
      "additionalInstruction": null
    },
    {
      "name": "boiling water",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "plain or vanilla 2% Greek yogurt",
      "quantity": "3 cups",
      "additionalInstruction": null
    },
    {
      "name": "gummy worms",
      "quantity": "12",
      "additionalInstruction": null
    }
  ],
  "totalTime": "60 min (includes 40 min cooling time)",
  "servings": "12 servings",
  "preparation": [
    "In a large bowl, with an electric mixer, beat cake mix with egg, milk, oil, and vanilla for 2 min on medium. Gently stir in boiling water until smooth (batter will be thin).",
    "Pour into lightly oiled 8\" round silicone cake pan.",
    "Microwave, uncovered, on high 5–7 min, or until centre is almost set. Rest in pan for 6 min; invert onto Cooling Rack to cool completely. Or, bake in preheated 350° F oven for 30–35 min, or until a toothpick inserted in centre of cake comes out clean. Cool 10 min before unmolding, then let cool completely.",
    "When cooled, crumble cake.",
    "Fill twelve 7-oz transparent cups with 2 heaping tbsp of crumbled cake, then top with 2 tbsp yogurt. Repeat with another layer of cake, then yogurt, and finally the remaining cake. Add a gummy worm to each cup."
  ],
  "tags": [
    {
      "slug": "easter",
      "name": "Easter"
    },
    {
      "slug": "birthday",
      "name": "Birthday"
    },
    {
      "slug": "vegetarian",
      "name": "Vegetarian"
    },
    {
      "slug": "low_sodium",
      "name": "Low-sodium"
    },
    {
      "slug": "onion_free",
      "name": "Onion-free"
    },
    {
      "slug": "gluten_free_e8446d0",
      "name": "Gluten-free"
    },
    {
      "slug": "sugar_conscious",
      "name": "Sugar Conscious"
    },
    {
      "slug": "dessert",
      "name": "Dessert"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "",
    "calories": 230,
    "fat": 7,
    "saturatedFat": 1.5,
    "transFat": 0.1,
    "cholesterol": 20,
    "sodium": 260,
    "carbohydrate": 33,
    "fiber": 2,
    "sugars": 20,
    "protein": 8
  },
  "tips": [
    "Turn plain yogurt into “mud”! Stir in 2 tbsp cocoa powder and 1&frasl;2 tbsp sugar into the yogurt before layering.",
    "Have fun with the layers! Swap yogurt for Chocolate Pudding, Dulce de Leche Pudding, Luscious Lemon Curd, Summer Berry Sweet Dip, or a combo.",
    "No Chocolate Cake Mix? Swap for your other fave Epicure dessert mixes, such as Ruby Red Velvet Cupcake Mix, Morning Glory Muffin Mix, or Fudgy Brownie Mix. Follow the recipe on the package, cool, crumble, and then continue with the final recipe step."
  ],
  "perfectlyBalanceYourPlate": "",
  "image": "Dirt-&-Worms.jpg",
  "thumbnail": "Dirt-&-Worms.webp",
  "products": [
    {
      "slug": "chocolate_cake_mix__pack_of_2_",
      "name": "Chocolate Cake Mix (Pack of 2)",
      "summary": [
        "Oh, baby! This is the stuff: Moist, fluffy, gluten free chocolate cake that’s unbelievably decadent. Elevate birthday parties, Friday date nights, weekend dinners with a cake that everyone will ask you to bake over and over again – for real, it’s that good! Best of all? It’s ready in less than 10 mins in the microwave.&nbsp;&nbsp;"
      ]
    },
    {
      "slug": "cooling_rack__set_of_2___1701277_",
      "name": "Cooling Rack (Set of 2)",
      "summary": [
        "These space-saving cooling racks are an absolute must-have for every at-home baker or chef.&nbsp;"
      ]
    },
    {
      "slug": "morning_glory_muffin_mix__2pk_",
      "name": "Morning Glory Muffin Mix (2pk)",
      "summary": [
        "Say good morning to moist, gluten free muffins packed with chunks of carrots, apples, coconut, and cranberries. Bake a batch in the microwave in just 15 mins and take a moment to enjoy a warm fruity muffin with your fave warm drink – or easily take them on the go any time of day!&nbsp;"
      ]
    },
    {
      "slug": "ruby_velvet_cupcake_mix__2pk_",
      "name": "Ruby Red Velvet Cupcake Mix (2pk)",
      "summary": [
        "A sweet, vanilla cupcake with subtle notes of cocoa. Skip the high sugar store-bought cupcakes and make a better-for-you version at home.&nbsp;"
      ]
    },
    {
      "slug": "fudgy_brownie_mix__pack_of_2_",
      "name": "Fudgy Brownie Mix (Pack of 2)",
      "summary": [
        "We’ll let you in on a little secret: You can make the fudgiest, chocolatiest brownies <em>ever </em>in the microwave in just 4 minutes (or 20 minutes in the oven)! Just add a few simple ingredients to our gluten free batter and let the magic unfold in your Multipurpose Steamer. When ready, slice ‘em up any way you like – on their own, topped with ice cream or icing, in a sundae, or as a dessert base.&nbsp;&nbsp;"
      ]
    }
  ]
}