{
  "name": "Easter Bunny Cake",
  "slug": "easter-bunny-cake",
  "description": "An Easter treat for your little bunnies. Carrot cake serves as the canvas for this season’s favourite friend. It’s moist, gluten-free, and sweet, but not too sweet. With a little creative cutting and crafting, this cake transforms into a whimsical bunny delight. Simply cover it with a luscious cream cheese icing and artfully arrange fresh fruit to bring your bunny to life.",
  "ingredients": [
    {
      "name": "medium-sized carrots",
      "quantity": "4",
      "additionalInstruction": null
    },
    {
      "name": "eggs",
      "quantity": "4",
      "additionalInstruction": null
    },
    {
      "name": "oil",
      "quantity": "<sup>2</sup>&frasl;<sub>3</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "crushed pineapple",
      "quantity": "1 cup",
      "additionalInstruction": null
    },
    {
      "name": "Carrot Cake Mix",
      "quantity": "2 pkgs",
      "additionalInstruction": null
    },
    {
      "name": "light cream cheese",
      "quantity": "2 bricks (8 oz/ 250 g each)",
      "additionalInstruction": "softened"
    },
    {
      "name": "unsalted butter",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": "softened"
    },
    {
      "name": "vanilla extract",
      "quantity": "1 tsp",
      "additionalInstruction": null
    },
    {
      "name": "icing sugar",
      "quantity": "1 cup",
      "additionalInstruction": null
    },
    {
      "name": "strawberries",
      "quantity": "4",
      "additionalInstruction": null
    },
    {
      "name": "blueberries",
      "quantity": "45",
      "additionalInstruction": null
    }
  ],
  "totalTime": "1 1/2 hrs (includes 30 min chill time)",
  "servings": "18 servings",
  "preparation": [
    "Preheat oven to 350° F.  Coarsely grate carrots; measure out 4 cups and set aside.",
    "Lightly oil two 8” Round Cake Pans. Set on a Sheet Pan.",
    "In a large bowl, whisk eggs with oil and pineapple. Stir in both mixes and 4 cups grated carrot. Divide batter between pans; smooth top. Bake for 35–40 min or until a toothpick inserted in centre comes out clean. Cool 10 min; unmold onto Cooling Racks.",
    "Let cakes cool completely while preparing icing. You can place them in the fridge to speed up the process. In a bowl, using an electric mixer, beat cream cheese with butter until smooth. Beat in vanilla. Beat in icing sugar, 1&frasl;2 cup at a time, until smooth.",
    "To assemble, place one cake in the center of another Sheet Pan or rectangular serving platter. This will be the face.",
    "Place the other cake on your work surface; this will be the ears and bow tie. Using a knife, cut two matching ovals from each side of the cake to make the ears. The centre of the cake (what’s left after you’ve cut out the ears) will be the bow tie. You can use a mixing bowl to help with the curve of the ears.",
    "Arrange the ears above the face and the bow tie below. Using 3-in-1 Spatula, cover the entire cakes with icing.",
    "Slice one strawberry in half, lengthwise. Use half to make a nose. Slice remaining strawberries, lengthwise. Arrange in the centre of each ear (pointy end pointing up). Arrange two blueberries to make eyes.",
    "Using the remaining blueberries, decorate bow tie."
  ],
  "tags": [
    {
      "slug": "easter",
      "name": "Easter"
    },
    {
      "slug": "gluten_free_e8446d0",
      "name": "Gluten-free"
    },
    {
      "slug": "dessert",
      "name": "Dessert"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "",
    "calories": 300,
    "fat": 17,
    "saturatedFat": 6,
    "transFat": 0.1,
    "cholesterol": 60,
    "sodium": 380,
    "carbohydrate": 32,
    "fiber": 2,
    "sugars": 22,
    "protein": 6
  },
  "tips": [
    "It’s easiest to cut and ice the cakes when they are completely chilled. If you have time, prepare the cakes a day ahead and keep them in the fridge until you are ready to assemble!",
    "For a ‘fluffy’ look (and hide any imperfections!) pat shredded coconut flakes evenly over the frosted bunny face and ears before decorating with fruit.",
    "To make whiskers, slice another carrot into thin strips and place on both sides of the nose."
  ],
  "perfectlyBalanceYourPlate": "",
  "image": "Easter_Bunny_Cake_1036x583.jpg",
  "thumbnail": "Easter_Bunny_Cake_1036x583.webp",
  "products": [
    {
      "slug": "carrot_cake_mix__pkg_of_2___1501271_",
      "name": "Carrot Cake Mix (Pack of 2)",
      "summary": [
        "Our apologies to the other carrot cakes out there but take one bite of our gluten free Carrot Cake, and it will be your go-to from now on. Light, decadent, fluffy, and moist, our gluten free baking mix&nbsp;makes it easy to create show-stopping cakes, cupcakes, and muffins — even for beginner bakers! &nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_423693c",
      "name": "Sheet Pan",
      "summary": [
        "Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"
      ]
    },
    {
      "slug": "cooling_rack__set_of_2___1701277_",
      "name": "Cooling Rack (Set of 2)",
      "summary": [
        "These space-saving cooling racks are an absolute must-have for every at-home baker or chef."
      ]
    }
  ]
}