{
  "name": "Fun Fruity Granola Bars",
  "slug": "fun-fruity-granola-bars",
  "description": "These bars tick off all the school snack boxes: nut free, dairy-free, and gluten-free (make sure to use GF oats). This makes a big batch – freeze what you don’t use for the week for easy grab and go snacks or a quick bite for those busy mornings.",
  "ingredients": [
    {
      "name": "Summer Berry Sweet Dip Mix",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "rolled oats",
      "quantity": "2 cups",
      "additionalInstruction": null
    },
    {
      "name": "Power Up Vanilla Protein Blend or Power Up Chocolate Protein Blend",
      "quantity": "1 scoop",
      "additionalInstruction": null
    },
    {
      "name": "unsweetened apple sauce",
      "quantity": "1 cup",
      "additionalInstruction": null
    },
    {
      "name": "coconut oil",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": "melted"
    },
    {
      "name": "chia seeds",
      "quantity": "2 tbsp",
      "additionalInstruction": null
    },
    {
      "name": "Cinnamon",
      "quantity": "1 <sup>1</sup>&frasl;<sub>2</sub> tsp",
      "additionalInstruction": null
    }
  ],
  "totalTime": "20 min",
  "servings": "30 bars (15 servings)",
  "preparation": [
    "Preheat oven to 375° F. Place Perfect Petites on Sheet Pan.",
    "Divide whole food topper and any additional toppings, if desired, into 30 wells in Perfect Petites.",
    "In bowl, stir oats and protein blend with apple sauce, coconut oil, chia seeds, and cinnamon.",
    "Spoon mixture into Perfect Petites; press to flatten.",
    "Bake until firm, 15 min. When cool, twist pan to pop out."
  ],
  "tags": [],
  "nutritionalInformation": {
    "servingSize": "2 bars",
    "calories": 110,
    "fat": 5,
    "saturatedFat": 3.5,
    "transFat": 0,
    "cholesterol": 0,
    "sodium": 20,
    "carbohydrate": 12,
    "fiber": 3,
    "sugars": 2,
    "protein": 4
  },
  "tips": [
    "Refrigerate cooled bars in an air-tight container up to 1 week or freeze up to 3 months."
  ],
  "perfectlyBalanceYourPlate": "Serve with 1 cup 2% plain Greek yogurt and 1 cup mixed berries.",
  "image": "thumbnail.jpg",
  "thumbnail": "thumbnail.webp",
  "products": [
    {
      "slug": "perfect_petites_a4d39ed",
      "name": "Perfect Petites",
      "summary": [
        "A versatile non-stick silicone pan that makes baking the cutest bite-sized portions easy and fun! Go beyond baking and use the Perfect Petites to make ice cubes, portion baby food and sauces, and more!&nbsp;"
      ]
    },
    {
      "slug": "power_up_chocolate_protein_blend__pouch_",
      "name": "Power Up Chocolate Protein Blend (Pouch)",
      "summary": [
        "We like to fuel our bodies and satisfy those chocolate cravings at the same time. Made with pea and fava bean protein, this blend turns into a velvety shake (just mix with water or milk) or morning smoothie with a luscious creamy texture, not chalky like a lot of other protein powders. It’s made with heat-stable probiotics which means baking with benefits! Add to pancake, waffle, muffin, or cookie batters. Power up your morning with an extra boost from 20 g of plant-based protein and essential amino acids.&nbsp;"
      ]
    },
    {
      "slug": "power_up_vanilla_protein_blend__pouch_",
      "name": "Power Up Vanilla Protein Blend (Pouch)",
      "summary": [
        "Fuel up first thing and stay fuller longer with rich smooth-tasting vanilla blend. Made with pea and fava bean protein, this blend turns into a velvety shake (just mix with water or milk) or morning smoothie with a luscious creamy texture, not chalky like a lot of other protein powders. It’s made with heat-stable probiotics which means baking with benefits! Add to pancake, waffle, muffin, or cookie batters. Power up your morning with an extra boost from 20 g of plant-based protein and essential amino acids.&nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_423693c",
      "name": "Sheet Pan",
      "summary": [
        "Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"
      ]
    },
    {
      "slug": "summer_berry_sweet_dip_mix_3b74ec9",
      "name": "Summer Berry Sweet Dip Mix",
      "summary": [
        "If you could capture sweet summer in a jar, this would be it. A tangy, fruity blend of raspberries, strawberries, hibiscus, and a touch of rooibos, Summer Berry works as a dip or seasoning for yogurt, oatmeal, smoothies, and more.&nbsp;"
      ]
    }
  ]
}