{
  "name": "Jalapeño Popper Hot Dip",
  "slug": "jalapeno-popper-hot-dip",
  "description": "Let’s spice up your dip game. This hot n’ creamy mix is packed with all the jalapeño flavour you love without all the fuss of prepping an appy—just mix, heat, and serve, all in the same dish. Top it off with Better Than Bacon Topper for that extra “wow” factor. Scoop it up with crackers or veggie sticks and watch it disappear faster than you can say \"game day!\".",
  "ingredients": [
    {
      "name": "Jalapeño Popper Hot Dip Mix",
      "quantity": "2 tbsp",
      "additionalInstruction": null
    },
    {
      "name": "cream cheese",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": "softened"
    },
    {
      "name": "sour cream",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "shredded cheddar cheese",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": null
    }
  ],
  "totalTime": "12 min",
  "servings": "10 servings",
  "preparation": [
    "Preheat oven to 350° F.",
    "In Rectangular Steamer or baking dish, combine hot dip mix with cream cheese, sour cream, and cheddar cheese.",
    "If desired, top with additional 1&frasl;4 cup cheddar cheese. Bake uncovered 10 min or until heated through. Serve with crackers, tortilla chips, toasted French bread slices, or sliced veggies."
  ],
  "tags": [],
  "nutritionalInformation": {
    "servingSize": "about 2 tbsp",
    "calories": 90,
    "fat": 7,
    "saturatedFat": 4.5,
    "transFat": 0.1,
    "cholesterol": 20,
    "sodium": 120,
    "carbohydrate": 2,
    "fiber": 0,
    "sugars": 1,
    "protein": 3
  },
  "tips": [
    "Make it in the microwave! In a 4-cup microwave-safe bowl, combine ingredients. Microwave uncovered on medium (50% power) for 2 min. Stir and top with 1&frasl;4 cup cheddar cheese, if desired. Microwave an additional 2 min on medium, or until cheese is starting to bubble."
  ],
  "perfectlyBalanceYourPlate": "",
  "image": "Jalapeno Popper Hot Dip.jpg",
  "thumbnail": "Jalapeno Popper Hot Dip.webp",
  "products": [
    {
      "slug": "better_than_bacon_topper__1701207_",
      "name": "Better Than Bacon Topper",
      "summary": [
        "Ok, bacon lovers; we see you. We know that bacon made from ‘pinto beans’ has you feeling a kind of way: skeptical. But trust us, this fan fave does not disappoint and it’s so easy to use. No need to grab a frying pan — just pop the top and shake on the taste of bacon with way less sodium, zero cholesterol, and no artificial flavors or colors (unlike popular brands).&nbsp;These crunchy bites are layered with smoky bacon flavor and are an amazing addition to salads, potatoes, eggs, and more!&nbsp;"
      ]
    },
    {
      "slug": "jalapeno_popper_dip_mix__single_",
      "name": "Jalapeno Popper Hot Dip Mix",
      "summary": [
        "Get all the bold flavor of jalapeño poppers—without the hassle! This creamy, crave-able hot dip is ready in minutes and destined to be your most requested recipe for every gathering, which is no problem when it’s this easy to make!&nbsp;"
      ]
    },
    {
      "slug": "rectangular_steamer_efd7225",
      "name": "Rectangular Steamer",
      "summary": [
        "Easy to clean. Easy to serve. Rectangular, silicone steamer is perfect for side dishes &amp; desserts."
      ]
    }
  ]
}