{
  "name": "Summer Berry Snowmen",
  "slug": "summer-berry-snowmen",
  "description": "Chewy, tender cookies, perfect for a cookie exchange!",
  "ingredients": [
    {
      "name": "unsalted butter",
      "quantity": "<sup>3</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": "softened"
    },
    {
      "name": "sugar",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "Summer Berry Sweet Dip Mix",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> cup",
      "additionalInstruction": null
    },
    {
      "name": "egg",
      "quantity": "1",
      "additionalInstruction": null
    },
    {
      "name": "vanilla extract",
      "quantity": "2 tsp",
      "additionalInstruction": null
    },
    {
      "name": "all-purpose flour",
      "quantity": "2 <sup>1</sup>&frasl;<sub>4</sub> cups",
      "additionalInstruction": null
    },
    {
      "name": "baking powder",
      "quantity": "<sup>1</sup>&frasl;<sub>2</sub> tsp",
      "additionalInstruction": null
    },
    {
      "name": "salt",
      "quantity": "<sup>1</sup>&frasl;<sub>4</sub> tsp",
      "additionalInstruction": null
    }
  ],
  "totalTime": "1 hr 20 min (includes 30 min chill time)",
  "servings": "25 cookies",
  "preparation": [
    "Using a stand mixer (with paddle attachment) or hand mixer, on medium speed, beat butter, sugar, and dip mix until smooth, about 2 min. Add egg and vanilla; beat on high until combined. Scraping down sides as needed.",
    "In a separate bowl, whisk together flour, baking powder, and salt. Gradually add to creamed mixture and mix until well combined.",
    "Loosely form dough into a ball. Divide in two. Using a lightly floured rolling pin, roll out to 1&frasl;4” thick on two floured Sheet Pan Liners. Place on Sheet Pans. Cover with plastic wrap and refrigerate 30 min, until firm.",
    "Preheat oven to 350° F.",
    "Remove one rolled out dough from liner; place on lightly floured surface. Cut into shapes using cookie cutters. Reroll scraps of dough and continue to cut until it’s used up. Place on Sheet Pan lined with Sheet Pan Liner. Don’t overcrowd.",
    "Bake, one sheet at a time, 12–14 min or until edges are set and surface appears dry. Rest in pan 5 min, then transfer to Cooling Racks to cool. Repeat with remaining dough. Cookies will keep well in an air-tight container, at room temperature, up to 5 days. Or freeze up to 2 months."
  ],
  "tags": [
    {
      "slug": "sheet_pan_3e5bebd",
      "name": "Sheet Pan"
    },
    {
      "slug": "christmas",
      "name": "Christmas"
    },
    {
      "slug": "low_sodium",
      "name": "Low-sodium"
    },
    {
      "slug": "onion_free",
      "name": "Onion-free"
    },
    {
      "slug": "sugar_conscious",
      "name": "Sugar Conscious"
    },
    {
      "slug": "garlic_free",
      "name": "Garlic-free"
    },
    {
      "slug": "dessert",
      "name": "Dessert"
    }
  ],
  "nutritionalInformation": {
    "servingSize": "1 cookie",
    "calories": 110,
    "fat": 6,
    "saturatedFat": 305,
    "transFat": 0.2,
    "cholesterol": 25,
    "sodium": 30,
    "carbohydrate": 14,
    "fiber": 0,
    "sugars": 5,
    "protein": 2
  },
  "tips": [
    "To decorate cookies, you’ll need royal icing and orange and black gel colour food colouring. Go to Royal Icing or buy it pre-made from most bulk stores. Fill one larger bowl with some of the royal icing, then divide the remainder between two smaller bowls. Stir orange food colouring into one and black in the other. Fit a piping bag with a small round icing tip; fill the bag with royal icing. Pipe a circular outline on each cookie. Staring with the first cookie, fill in each circle. Allow to set. Wash bag, then fill orange icing. Pipe small triangle outlines in the centre of each cookie – this is the nose. Fill in triangles. Wash bag, then fill with black icing. Pipe two small dots for eyes and a happy smile. Let sit until icing is completely set, about 2 hours.",
    "For soft, chewy cookies, make sure to bake only until edges start to set. If they’ve started to turn golden-brown, the cookies will be on the crunchier side. If you’ve cut your cookies into shapes that are smaller than 3” start checking for doneness after 10 min."
  ],
  "perfectlyBalanceYourPlate": "",
  "image": "summer_berry_snowmen_1036x583.jpg",
  "thumbnail": "summer_berry_snowmen_1036x583.webp",
  "products": [
    {
      "slug": "summer_berry_sweet_dip_mix_3b74ec9",
      "name": "Summer Berry Sweet Dip Mix",
      "summary": [
        "If you could capture sweet summer in a jar, this would be it. A tangy, fruity blend of raspberries, strawberries, hibiscus, and a touch of rooibos, Summer Berry works as a dip or seasoning for yogurt, oatmeal, smoothies, and more.&nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_423693c",
      "name": "Sheet Pan",
      "summary": [
        "Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"
      ]
    },
    {
      "slug": "sheet_pan_liner__1716111_",
      "name": "Sheet Pan Liner",
      "summary": [
        "Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"
      ]
    },
    {
      "slug": "cooling_rack__set_of_2___1701277_",
      "name": "Cooling Rack (Set of 2)",
      "summary": [
        "These space-saving cooling racks are an absolute must-have for every at-home baker or chef.&nbsp;"
      ]
    }
  ]
}