{"name":"Baked Alaska Cupcakes","slug":"baked-alaska-cupcakes","description":"This is the BEST make-ahead dessert ever. It looks lengthy, but it’s very easy. Cheat and buy cupcakes or make a big batch and freeze the rest for treats down the line.","ingredients":[{"name":"ice cream or frozen yogurt","quantity":"1 cup","additionalInstruction":"your favourite"},{"name":"large egg whites","quantity":"4","additionalInstruction":null},{"name":"granulated sugar","quantity":"1 cup","additionalInstruction":null},{"name":"cream of tartar","quantity":"<sup>1</sup>&frasl;<sub>4</sub> tsp","additionalInstruction":null},{"name":"vanilla extract","quantity":"1 tsp","additionalInstruction":null},{"name":"chocolate cupcakes","quantity":"4","additionalInstruction":null}],"totalTime":"35 min","servings":"4 servings","preparation":["Line 4 cups of a muffin maker with plastic wrap; let the edges overhang. Divide ice cream between muffin cups. Press down to pack, then cover with overhanging plastic wrap. Freeze until firm.","Meanwhile, place egg whites, sugar and cream of tartar in a large bowl set over a saucepan of simmering water (or a double boiler). Whisk constantly until sugar dissolves and whites are warm, 3–4 minutes. Whisk in vanilla extract.","If using a standing mixer, transfer egg whites into its mixing bowl and select the whisk attachment. Or if using a handheld mixer, use same bowl egg whites are already in. Beat egg whites, starting at low speed, then gradually increase to high speed until stiff, glossy peaks form. This will take 5–7 minutes.","Trim tops of cupcakes so they’re flat. Place cupcakes on Sheet Pan lined with Sheet Pan Liner. Unmold ice cream from muffin tin. Top each cupcake with ice cream. Fill a piping bag with meringue mixture. Pipe meringue overtop so that it’s completely covered. Don’t worry if it looks messy! Using the tines of a fork, make decorative swirls. Freeze at least 6 hours or up to 3 days.","Just before serving, preheat oven to 500° F (260° C). Bake until edges of meringue turn dark. Or using a kitchen torch, skip the oven and just torch meringue to desired doneness. Serve immediately."],"tags":[{"slug":"dessert","name":"Dessert"}],"nutritionalInformation":{"servingSize":"","calories":430,"fat":9,"saturatedFat":0,"transFat":0,"cholesterol":35,"sodium":240,"carbohydrate":82,"fiber":2,"sugars":68,"protein":2},"tips":["Chef’s Tip: For fabulous homemade cupcakes, try Epicure’s Chocolaty Temptation Cupcakes."],"perfectlyBalanceYourPlate":"","imagePath":"../images/1610552955076-recipeMainImagePath.jpg","products":[{"slug":"sheet_pan_423693c","name":"Sheet Pan"},{"slug":"sheet_pan_liner__1716111_","name":"Sheet Pan Liner"},{"slug":"muffin_maker__2pk_","name":"Muffin Maker (Set of 2)"}]}