{"name":"Chocolate Lasagna","slug":"chocolate-lasagna","description":"We couldn’t get enough of lasagna for dinner, so we’re having it for dessert, too! With layers of cookie crumbs, sweet cream, and rich chocolate pudding, this is an epic, no-bake delight. Like traditional lasagna, this dessert is a labour of love. While it is a simple recipe, the individual layers require a bit of prep and patience, but we promise it’s worth it!","ingredients":[{"name":"chocolate baking crumbs","quantity":"1 cup + 2 tbsp","additionalInstruction":"divided"},{"name":"unsalted butter","quantity":"2 tbsp","additionalInstruction":"melted"},{"name":"whipping cream","quantity":"2 cups","additionalInstruction":null},{"name":"icing sugar","quantity":"<sup>1</sup>&frasl;<sub>4</sub> cup + 3 tbsp","additionalInstruction":"divided"},{"name":"cream cheese","quantity":"1 brick (8 oz/250 g)","additionalInstruction":"room temperature"},{"name":"vanilla extract","quantity":"<sup>1</sup>&frasl;<sub>2</sub> tsp","additionalInstruction":null},{"name":"Chocolate Instant Pudding Mix ","quantity":"1 pkg","additionalInstruction":null},{"name":"milk","quantity":"2 cups","additionalInstruction":"your choice"}],"totalTime":"2 hrs & 40 min (includes 2 hrs freeze time)","servings":"16 servings","preparation":["Add 1 cup chocolate baking crumbs to a bowl with butter. Stir well to combine.","In an 8\" X 8\" baking dish, press the crumb mixture into the bottom of the pan to create a crust. Place in refrigerator.","Using a hand mixer, beat whipping cream in a large bowl on medium-high speed until soft peaks form. Add 3 tbsp icing sugar and continue beating until medium-stiff peaks form. Set aside.","In another large bowl, beat the cream cheese, remaining 1&frasl;4 cup icing sugar, and vanilla. Fold in whipped cream mixture.","Remove crust from refrigerator. Gently and evenly spread out half the cream cheese mixture on the crust. Place in refrigerator to set, about 10 min. Keep remaining cream cheese mixture in the refrigerator until step 8.","Meanwhile, in a large bowl, whisk pudding mix with milk for 2 min. Cover and refrigerate 10 min or until thickened.","Spread the prepared pudding over the cream cheese layer. Place in refrigerator to set, about 10 min.","Add remaining cream cheese mixture overtop pudding, spreading out evenly. Sprinkle with remaining 2 tbsp crumbs. Cover with plastic wrap and freeze at least 2 hrs or until ready to serve."],"tags":[],"nutritionalInformation":{"servingSize":"","calories":240,"fat":18,"saturatedFat":11,"transFat":0.1,"cholesterol":60,"sodium":140,"carbohydrate":16,"fiber":1,"sugars":11,"protein":3},"tips":["To cut clean pieces, run your knife under warm water and when slicing, continually wipe the knife clean."],"perfectlyBalanceYourPlate":"","imagePath":"../images/chocolate_lasagna_1036x583.jpg","products":[{"slug":"chocolate_instant_pudding_mix__pack_of_3___caldic__bc2ef56","name":"Chocolate Instant Pudding Mix (Pack of 2)"}]}