{"name":"Cinnamon Snowflake Snaps","slug":"cinnamon-snowflake-snaps","description":"A cookie with crispy & crunchy edges, perfect to dunk in milk!","ingredients":[{"name":"unsalted butter","quantity":"<sup>3</sup>&frasl;<sub>4</sub> cup","additionalInstruction":"softened"},{"name":"packed brown sugar","quantity":"<sup>3</sup>&frasl;<sub>4</sub> cup","additionalInstruction":null},{"name":"egg","quantity":"1","additionalInstruction":null},{"name":"fancy molasses","quantity":"<sup>1</sup>&frasl;<sub>2</sub> cup","additionalInstruction":null},{"name":"all-purpose flour","quantity":"3 cups","additionalInstruction":null},{"name":"Cinnamon or Apple Pie Spice","quantity":"2 tsp","additionalInstruction":null},{"name":"baking soda","quantity":"<sup>1</sup>&frasl;<sub>2</sub> tsp","additionalInstruction":null},{"name":"salt","quantity":"<sup>1</sup>&frasl;<sub>2</sub> tsp","additionalInstruction":null}],"totalTime":"2 hrs (includes 30 min chill time)","servings":"30 cookies","preparation":["Using a stand mixer (with paddle attachment) or hand mixer, on medium speed, beat butter with sugar, about 2 min. Beat in egg, then molasses.","In a separate bowl, whisk together flour, Cinnamon or Apple Pie Spice, baking soda, and salt. Gradually add to creamed mixture and mix until well combined.","Form dough into a ball. Divide in two. Using a floured rolling pin, roll out to 1&frasl;4” thick on two floured Sheet Pan Liners. Place on Sheet Pans. Cover with plastic wrap and refrigerate 30 min, until firm. If making ahead, do not roll out and cover in plastic wrap; refrigerate up to 1 week or freeze up to 2 months.","Preheat oven to 350° F.","Remove one rolled out dough from liner; place on lightly floured surface. Cut into shapes using cookie cutters. Reroll scraps of dough and continue to cut until it’s used up. Place on Sheet Pan lined with Sheet Pan Liner. Don’t overcrowd.","Bake, one sheet at a time, until firm, 16–18 min. Rest in pan 5 min, then transfer to Cooling Racks. Repeat with remaining dough. Cookies will keep well in an air-tight container, at room temperature, up to 5 days. Or freeze up to 2 months."],"tags":[{"slug":"dessert","name":"Dessert"}],"nutritionalInformation":{"servingSize":"","calories":130,"fat":5,"saturatedFat":3,"transFat":0.1,"cholesterol":20,"sodium":65,"carbohydrate":19,"fiber":0,"sugars":9,"protein":2},"tips":["To make a cookie ornament, using a straw, poke out a small hole in each cookie before baking. After baking, thread hole with a pretty ribbon or string.","For really snappy cookies, roll dough between 1&frasl;8” – 1&frasl;4” thick. Start checking for doneness after 12 min. They should be firm out of the oven but will continue to crisp up while cooling."],"perfectlyBalanceYourPlate":"","image":"cinnamon_snowflakes_snaps_1036x583.jpg","products":[{"slug":"sheet_pan_423693c","name":"Sheet Pan","summary":["Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"]},{"slug":"sheet_pan_liner__1716111_","name":"Sheet Pan Liner","summary":["Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"]},{"slug":"cooling_rack__set_of_2___1701277_","name":"Cooling Rack (Set of 2)","summary":["These space-saving cooling racks are an absolute must-have for every at-home baker or chef."]}]}