{"name":"Corn Ribs","slug":"corn-ribs","description":"This might sound corny, but we’re totally digging this viral TikTok trend. Pop your corn cobs in your air fryer and watch the magic happen: they curl right into this awesome, rib-like shape. Plus, the kernels open up to create nooks and crannies for the deliciously seasoned mayo to nestle in. A word of caution: handle with care when cutting the corn, ensuring a flat surface on the cutting board to avoid any unexpected rolls.","ingredients":[{"name":"small corn cobs","quantity":"4","additionalInstruction":"shucked"},{"name":"All-Dressed Fries Seasoning or Cajun Fries Seasoning","quantity":"2 tbsp","additionalInstruction":"divided"},{"name":"olive oil","quantity":"2 tbsp","additionalInstruction":null},{"name":"light mayonnaise","quantity":"<sup>1</sup>&frasl;<sub>4</sub> cup","additionalInstruction":null}],"totalTime":"20 min","servings":"4 servings","preparation":["Preheat air fryer to 375° F.","Carefully slice each corn cob in half widthwise. Place the flat end of the corn cob halves down on the cutting board and carefully slice each half into quarters by placing the palm of your non-dominant hand on top on the knife blade for leverage and pushing down. You should have 32 pieces (“ribs”) in total.","In a small bowl, whisk 1 1&frasl;2 tbsp seasoning with oil. Brush over corn ribs.","Place corn ribs in air fryer basket in a single layer (it’s OK if they overlap slightly). Cook 12–15 min, or until lightly browned and a little crispy. (Depending on the size of your air fryer, you may need to cook ribs in two batches.)","In a bowl, combine remaining 1&frasl;2 tbsp seasoning with mayo. Serve with corn ribs for dunking."],"tags":[{"slug":"epic_life_lunch","name":"Lunch"},{"slug":"low_sodium","name":"Low-sodium"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"dinner","name":"Dinner"},{"slug":"lunch","name":"Lunch"},{"slug":"vegetarian","name":"Vegetarian"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"sides","name":"Side Dishes"},{"slug":"n4th_of_july","name":"Independence Day"},{"slug":"epic_life_dinner","name":"Dinner"},{"slug":"game_day","name":"Game Day"},{"slug":"air_fryer","name":"Air Fryer"}],"nutritionalInformation":{"servingSize":"1 corn cob","calories":190,"fat":11,"saturatedFat":2,"transFat":0,"cholesterol":0,"sodium":140,"carbohydrate":22,"fiber":2,"sugars":8,"protein":3},"tips":["To safely cut corn cobs, make sure to use a sharp knife and place a wet towel under your cutting board to stabilize it.","Depending on the size of your corn cobs, you may need to air fry larger pieces a few extra minutes to get those nice, crispy bits."],"perfectlyBalanceYourPlate":"Serve with 4 oz (113 g) lean protein, and 2 cups leafy greens with 1 tbsp Epicure Dressing.","image":"corn_ribs_1036x583.jpg","products":[{"slug":"all_dressed_fries_seasoning","name":"All-Dressed Fries Seasoning","summary":["When you can’t decide on a flavour, we say, have ‘em all! All Dressed is a classic Canadian chip seasoning and we’ve put an epic twist on it. Salt &amp; vinegar, ketchup, sour cream &amp; onion, and BBQ are all here in one amazingly tasty, zero sodium blend. You’re going to want to shake this on fries, homemade chips, popcorn, potato salad, and more!&nbsp;"]},{"slug":"cajun_fries_seasoning","name":"Cajun Fries Seasoning","summary":["We love to make our taste buds dance with this <strong>Cajun Fries Seasoning</strong>. This blend of premium herbs and spices creates an earthy, piquant flavour that tastes great and packs a punch. It's perfect for anyone who wants to add excitement and heat to their favourite snack. Sprinkle as much or as little as you like over your spuds for a healthy alternative to restaurant fries with added seasonings.&nbsp;"]}]}