{"name":"Crispy & Crunchy Cod","slug":"crispy-crunchy-cod","description":"Don’t spend extra $$ on the pricy fresh stuff here. Start with frozen fish fillets – you don’t have to defrost them before cooking. To help make the coating stick, lightly coat frozen fillets with flour, then dip them in a beaten egg (use two eggs) before adding the coating mix. Since you’re at it- why not make a double batch – coated fish fillets are freezer friendly!","ingredients":[{"name":"skinless cod fillet","quantity":"1 lb (450 g)","additionalInstruction":null},{"name":"mayonnaise or 2% plain Greek yogurt","quantity":"2 tbsp","additionalInstruction":null},{"name":"Crispy & Crunchy Coating Mix","quantity":"1 pkg","additionalInstruction":null}],"totalTime":"20 min","servings":"4 servings","preparation":["Preheat oven to 425° F. Place two Cooling Racks on Sheet Pan lined with Sheet Pan Liner; lightly brush racks with oil to prevent sticking.","Pat fish dry; cut into bite-sized pieces. Coat with mayo.","Place mix in a shallow dish. Using tongs or your hands, add fish pieces one at time, gently rotating and pressing to coat.","Place fish on racks, leaving some space between each piece. Bake 12 min or until golden and cooked through. Let rest on racks a few minutes before removing to prevent sticking."],"tags":[{"slug":"epic_life_lunch","name":"Lunch"},{"slug":"fish___seafood","name":"Fish & Seafood"},{"slug":"low_sodium","name":"Low-sodium"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"dinner","name":"Dinner"},{"slug":"lunch","name":"Lunch"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"sheet_pan_3e5bebd","name":"Sheet Pan"},{"slug":"dairy_free","name":"Dairy-free"},{"slug":"epic_life_dinner","name":"Dinner"}],"nutritionalInformation":{"servingSize":"","calories":190,"fat":6,"saturatedFat":1,"transFat":0,"cholesterol":45,"sodium":370,"carbohydrate":13,"fiber":0,"sugars":1,"protein":19},"tips":["Cook time depends on the thickness of your fish; start checking at 10 min if your fish nuggets are on the thinner side. Swap cod for salmon or snapper.","Make fish & chips! For fast fries, use frozen ones and season with your favourite Epicure Seasoning."],"perfectlyBalanceYourPlate":"Serve with 1 cup sliced veggies, 2 tbsp favourite Epicure Dip, and 1 cup oven fries or cooked grains, your choice.","image":"crispy_crunchy_cod_1036x583.jpg","products":[{"slug":"crispy___crunchy_coating__pkg_of_3_","name":"Crispy & Crunchy Coating (Pkg of 3)","summary":["Craving the crunch? Add a crispy gluten free coating – that’s never soggy or bland – to protein and veggies and bake them in the oven. You’ll get all the taste of your fave fried foods without a trace of greasiness, so you can enjoy them whenever the craving strikes!&nbsp;&nbsp;"]},{"slug":"sheet_pan_423693c","name":"Sheet Pan","summary":["Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"]},{"slug":"sheet_pan_liner__1716111_","name":"Sheet Pan Liner","summary":["Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"]},{"slug":"cooling_rack__set_of_2___1701277_","name":"Cooling Rack (Set of 2)","summary":["These space-saving cooling racks are an absolute must-have for every at-home baker or chef.&nbsp;"]}]}