{"name":"Crustless Veggie Quiche","slug":"crustless-veggie-quiche","description":"Don't know what to do with the extra veggies in your fridge? Make this easy, protein-rich veggie quiche! Eggs are an affordable, high-quality protein source to support strong muscles and keep you full all morning. Use cottage cheese for even more of a protein boost! Drizzle prepared Hollandaise Sauce over the quiches—the subtle, sweet tang of the sauce compliments the chives and cheese in CCB Dip Mix.","ingredients":[{"name":"large eggs","quantity":"12 ","additionalInstruction":null},{"name":"milk","quantity":"<sup>3</sup>&frasl;<sub>4</sub> cup","additionalInstruction":"your choice"},{"name":"CCB Dip Mix or Lemon Dilly Dip Mix","quantity":"2–3 tbsp","additionalInstruction":null},{"name":"Sea Salt","quantity":null,"additionalInstruction":"optional"},{"name":"Black Pepper","quantity":null,"additionalInstruction":"optional"},{"name":"grated cheese","quantity":"1 cup","additionalInstruction":"your choice, divided"},{"name":"finely diced mixed fresh or frozen vegetables","quantity":"1 <sup>1</sup>&frasl;<sub>2</sub> cups","additionalInstruction":null}],"totalTime":" 30 min","servings":"24 quiches","preparation":["Preheat oven to 375° F (190° C). Lightly oil Muffin Maker with vegetable oil.","In a large bowl, whisk together eggs, milk, and seasoning or dip mix, and season to taste.","Add veggies and stir to combine. Stir in half of the cheese.","Scoop the mixture evenly into Muffin Maker, then sprinkle a small amount of reserved cheese over each.","Bake in the oven for 20–25 minutes, or until the egg is fully set and the cheese has just started to turn golden on top.","Let cool before removing from the pan."],"tags":[{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"low_sodium","name":"Low-sodium"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"breakfast","name":"Breakfast"},{"slug":"epic_life_breakfast","name":"Breakfast"}],"nutritionalInformation":{"servingSize":"2 quiches","calories":140,"fat":9,"saturatedFat":3.5,"transFat":0.1,"cholesterol":195,"sodium":150,"carbohydrate":5,"fiber":1,"sugars":2,"protein":10},"tips":["Slash time in the oven by steaming the veggies in the microwave in Rectangular Steamer before adding to Muffin Maker and baking.","Make a big batch and have your breakfast ready for the week. Freeze individual portions and reheat 2–3 min in the microwave."],"perfectlyBalanceYourPlate":"Enjoy 2 mini quiche with 2 slices of toast with 2 tsp butter and 1 sliced tomato.","image":"crustless_veggie_quiche_1036x583.jpg","products":[{"slug":"ccb_dip_mix_b61a530","name":"CCB Dip Mix","summary":["<strong>Cheese. Chives. Bacon. </strong>How's that for a totally irresistible trio? Our very own smoky vegetarian bacon, made from pinto beans, is the secret star of this oh-so-yummy dip.","This blend is all about versatility and we recommend taking it way beyond the dip bowl—use CCB in any dish that could use a little levelling up.&nbsp;","<br>"]},{"slug":"lemon_dilly_dip_mix_cefe2b4","name":"Lemon Dilly Dip Mix","summary":["Beyond being one of our most-loved kid-friendly dips – they love it for dunking chicken strips, fish bites, and veggies – Lemon Dilly is all about versatility. With loads of dill and a hint of lemon zest, it makes an utterly delicious tzatziki and spread for burgers and sandwiches, and levels up everything from salad dressing and salmon to pasta and vegetables.&nbsp;&nbsp;"]},{"slug":"muffin_maker__2pk_","name":"Muffin Maker (Set of 2)","summary":["Make perfect portions of your favourite sweet or savoury cupcakes, muffins, frittatas, meatloaves, &amp; more!"]},{"slug":"rectangular_steamer_efd7225","name":"Rectangular Steamer","summary":["Easy to clean. Easy to serve. Rectangular, silicone steamer is perfect for side dishes &amp; desserts."]}]}