{"name":"Lemon Curd Easter Egg Cookies ","slug":"lemon-curd-easter-egg-cookies","description":"Whip up these gluten-free cookies for a sunny spin on spring treats! Ideal for Easter gatherings, these cookies, made with just a few ingredients, are like bites of sunshine. The lemon curd filling acts as the adorable “egg yolk”—check out our recipe tip about adding it to the cookies after baking for an extra burst of lemony goodness. And, to really make them pop, grab a piping bag instead of spooning the curd in. These cookies are best enjoyed at home since they can get a bit sticky on the go—if you’re set on traveling with them, bake them as directed, with the lemon curd already added.","ingredients":[{"name":"Shortbread Cookie Mix ","quantity":"1 pkg","additionalInstruction":null},{"name":"unsalted butter","quantity":"<sup>1</sup>&frasl;<sub>2</sub> cup","additionalInstruction":"softened "},{"name":"water","quantity":"1 tbsp","additionalInstruction":null},{"name":"Luscious Lemon Curd","quantity":"<sup>1</sup>&frasl;<sub>3</sub> cup prepared","additionalInstruction":"chilled "},{"name":"eggs","quantity":"3","additionalInstruction":null},{"name":"Luscious Lemon Curd Mix","quantity":"1 pkg","additionalInstruction":null},{"name":"water","quantity":"<sup>1</sup>&frasl;<sub>2</sub> cup","additionalInstruction":null},{"name":"butter","quantity":"1 tbsp","additionalInstruction":"optional"}],"totalTime":"35 min","servings":"15 cookies","preparation":["Preheat oven to 375°F. Line Sheet Pan with Sheet Pan Liner.","Using a stand mixer (with paddle attachment) or hand mixer, on medium speed, beat mix with butter and water for 2–3 min or until a soft, uniform dough forms.","Roll dough into 15 balls, about one heaping tbsp each. Using your hands, flatten and form each ball into an egg shape. Arrange on pan, spacing 1\" apart. Using your thumb, or the back of a small spoon, make a small indent at the bottom of the cookie. To help them keep their shape, hold the sides of the cookie, and press any cracks that form on the edges back into place. Chill in fridge 5 min.","Fill each indent with lemon curd, about 1 tsp per cookie.","Bake 14–16 min or until edges are light golden. Let cool on pan completely before removing.","Using a sifter or a fine mesh strainer, dust with icing sugar, if desired."],"tags":[{"slug":"dessert","name":"Dessert"},{"slug":"low_sodium","name":"Low-sodium"},{"slug":"easter","name":"Easter"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"onion_free","name":"Onion-free"},{"slug":"vegetarian","name":"Vegetarian"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"sheet_pan_3e5bebd","name":"Sheet Pan"},{"slug":"appetizers___small_bites","name":"Appetizers & Small Bites"},{"slug":"epic_life_desserts","name":"Desserts"},{"slug":"garlic_free","name":"Garlic-free"}],"nutritionalInformation":{"servingSize":"1 cookie","calories":120,"fat":7,"saturatedFat":4,"transFat":0.3,"cholesterol":25,"sodium":35,"carbohydrate":14,"fiber":1,"sugars":5,"protein":1},"tips":["For a brighter lemon flavour, add lemon curd after the cookies have baked. After making indents, bake as directed. Once baked, remove from oven and re-indent each cookie (they will have puffed up). Cool completely, dust with icing sugar (if desired) and fill indents with lemon curd."],"perfectlyBalanceYourPlate":"","image":"egg_cookies_1036x583.jpg","products":[{"slug":"shortbread_cookies_mix__2pk_","name":"Shortbread Cookie Mix (2pk)","summary":["We’re taking Shortbread Cookies beyond the holiday season and making them an everyday delight because they are just too good to only be enjoyed once a year! Our gluten free baking mix is a dream to work with. Just add butter and water (and salt, if you like) and stir it up! It’s super easy to work with and a great way to get kids involved in baking without a ton of mess — and the cookies turn out perfectly each and every time.&nbsp;&nbsp;"]},{"slug":"luscious_lemon_curd_mix__pkg_of_2_","name":"Luscious Lemon Curd Mix (Pack of 2)","summary":["With our fool-proof Luscious Lemon Curd Mix, wave goodbye to yolk separation and double boilers in favour of our fave kitchen tool: the microwave. Simply mix the blend with eggs &amp; water and you’ve got sweet, lemony luscious curd in two minutes—talk about a game changer!&nbsp;&nbsp;"]},{"slug":"sheet_pan_423693c","name":"Sheet Pan","summary":["Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"]},{"slug":"sheet_pan_liner__1716111_","name":"Sheet Pan Liner","summary":["Nonstick silicone baking sheet. Ideal for baking, roasting, sheet pan meals &amp; more!"]}]}