{"name":"Lentil Souvlaki & Tzatziki Flatbread","slug":"lentil-souvlaki-tzatziki-flatbread","description":"Mediterranean magic on the grill! Liven up your lentil game with homemade tzatziki. This recipe is a breeze to whip up, and it’s vegetarian-friendly, making it a great choice for anyone looking for exciting meatless options for dinner.","ingredients":[{"name":"2% plain Greek yogurt","quantity":"1 cup","additionalInstruction":null},{"name":"Lemon Dilly Dip","quantity":"1 tbsp","additionalInstruction":null},{"name":"cucumber","quantity":"<sup>1</sup>&frasl;<sub>2</sub>","additionalInstruction":null},{"name":"Sea Salt","quantity":null,"additionalInstruction":"to taste"},{"name":"Black Pepper","quantity":null,"additionalInstruction":"to taste"},{"name":"lentils","quantity":"1 can (19 oz/540 ml) ","additionalInstruction":null},{"name":"Chicken Souvlaki Seasoning or Greek Dressing Mix","quantity":"1 tbsp","additionalInstruction":null},{"name":"olive oil","quantity":"1 tbsp","additionalInstruction":null},{"name":"naan breads","quantity":"4","additionalInstruction":null},{"name":"crumbled feta cheese","quantity":"1 cup","additionalInstruction":null}],"totalTime":"12 min","servings":"8 servings","preparation":["Preheat grill to medium.","Meanwhile, make tzatziki. In a bowl, stir together yogurt and dip mix. Grate cucumber on a box grater. Wrap in a kitchen towel; squeeze out excess liquid. Stir cucumber into yogurt. Add salt and pepper to taste. Set aside.","Drain and rinse lentils. Place in small bowl; stir in seasoning.","Lightly brush both sides of naan breads with oil. Place tzatziki, lentils, oiled bread and cheese on a Sheet Pan and head to the grill!","Place bread on grill. Barbecue until one side is lightly charred, about 2 min. Remove from grill; spread grilled sides with tzatziki then top with lentils and cheese.","Place back on grill; close lid and barbecue until cheese melts, 1–2 min."],"tags":[{"slug":"vegetarian","name":"Vegetarian"},{"slug":"dinner","name":"Dinner"},{"slug":"lunch","name":"Lunch"},{"slug":"low_sodium","name":"Low-sodium"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"bbq","name":"BBQ"}],"nutritionalInformation":{"servingSize":"1/2 flatbread","calories":250,"fat":8,"saturatedFat":4,"transFat":0,"cholesterol":20,"sodium":450,"carbohydrate":30,"fiber":8,"sugars":4,"protein":13},"tips":["Infuse olive oil with your favourite Epicure Seasoning or Dip Mix. Blend 1 cup oil with 3 tbsp seasoning or mix. Let stand overnight."],"perfectlyBalanceYourPlate":"","image":"thumbnail.jpg","products":[{"slug":"lemon_dilly_dip_mix_cefe2b4","name":"Lemon Dilly Dip Mix","summary":["Beyond being one of our most-loved kid-friendly dips – they love it for dunking chicken strips, fish bites, and veggies – Lemon Dilly is all about versatility. With loads of dill and a hint of lemon zest, it makes an utterly delicious tzatziki and spread for burgers and sandwiches, and levels up everything from salad dressing and salmon to pasta and vegetables.&nbsp;&nbsp;"]},{"slug":"chicken_souvlaki_seasoning__pkg_of_3_","name":"Chicken Souvlaki Seasoning (Pkg of 3)","summary":["A Greek-inspired meal, souvlaki is marinated meat grilled on a skewer, often served with warm pita bread and tzatziki. No grill? No problem. Skip the skewers and put your Sheet Pan to work to make equally tasty Chicken Souvlaki in 20 minutes in the oven.&nbsp;&nbsp;"]},{"slug":"greek_dressing_mix_d75eccd","name":"Greek Dressing Mix","summary":["Herbs make salad dressings taste great, but they can be a pain to buy and use while fresh. Enter our Greek Dressing to solve the problem. Packed with only good food ingredients, including garlic, oregano, mint, and zero additives, it’s easy to make your own healthy dressing with this simple blend. Just mix it with olive oil and red wine vinegar and give it a shake. Add crumbled feta or Greek yogurt for a creamier dressing.&nbsp;"]},{"slug":"sheet_pan_423693c","name":"Sheet Pan","summary":["Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"]}]}