{"name":"Mixed Berry Muffin Smoothie","slug":"mixed-berry-muffin-smoothie","description":"Ridiculously yummy, this packs a berry-good flavour that tastes like a freshly baked muffin. The banana not only adds natural sweetness but also bumps potassium uptake. Plus, one scoop of protein powder gives you 20% of the daily need for potassium. A great way to start your morning!","ingredients":[{"name":"unsweetened coconut or almond milk","quantity":"2 cups","additionalInstruction":null},{"name":"frozen banana","quantity":"1 ","additionalInstruction":"sliced thickly"},{"name":"frozen mixed berries","quantity":"1 cup","additionalInstruction":null},{"name":"quick cooking gluten-free oats","quantity":"<sup>1</sup>&frasl;<sub>3</sub> cup","additionalInstruction":null},{"name":"Power Up Vanilla Protein Blend or Power Up Chocolate Protein Blend","quantity":"2 scoops","additionalInstruction":null},{"name":"Apple Pie Spice or Cinnamon","quantity":"<sup>1</sup>&frasl;<sub>2</sub> tsp","additionalInstruction":null}],"totalTime":"3 min","servings":"2 servings","preparation":["In a blender, combine milk, banana, berries, oats, protein blend, and apple pie spice until smooth, 30–45 sec.","Pour into a chilled glass and enjoy!"],"tags":[{"slug":"epic_life_breakfast","name":"Breakfast"},{"slug":"breakfast","name":"Breakfast"},{"slug":"drinks","name":"Beverages"},{"slug":"vegan","name":"Vegan"},{"slug":"dairy_free","name":"Dairy-free"}],"nutritionalInformation":{"servingSize":"","calories":300,"fat":8,"saturatedFat":5,"transFat":0,"cholesterol":0,"sodium":310,"carbohydrate":39,"fiber":10,"sugars":15,"protein":23},"tips":[],"perfectlyBalanceYourPlate":"Serve with 1 slice wholegrain bread and 1 tsp nut butter.","image":"6761_mixed_berry_muffin_smoothie_1036x583.jpg","products":[{"slug":"power_up_vanilla_protein_blend__pouch_","name":"Power Up Vanilla Protein Blend (Pouch)","summary":["Fuel up first thing and stay fuller longer with rich smooth-tasting vanilla blend. Made with pea and fava bean protein, this blend turns into a velvety shake (just mix with water or milk) or morning smoothie with a luscious creamy texture, not chalky like a lot of other protein powders. It’s made with heat-stable probiotics which means baking with benefits! Add to pancake, waffle, muffin, or cookie batters. Power up your morning with an extra boost from 20 g of plant-based protein and essential amino acids.&nbsp;"]},{"slug":"power_up_chocolate_protein_blend__pouch_","name":"Power Up Chocolate Protein Blend (Pouch)","summary":["We like to fuel our bodies and satisfy those chocolate cravings at the same time. Made with pea and fava bean protein, this blend turns into a velvety shake (just mix with water or milk) or morning smoothie with a luscious creamy texture, not chalky like a lot of other protein powders. It’s made with heat-stable probiotics which means baking with benefits! Add to pancake, waffle, muffin, or cookie batters. Power up your morning with an extra boost from 20 g of plant-based protein and essential amino acids.&nbsp;"]}]}