{"name":"Napoleons","slug":"napoleons","description":"","ingredients":[{"name":"milk","quantity":"1 cup","additionalInstruction":null},{"name":"vanilla extract","quantity":"1 tsp","additionalInstruction":null},{"name":"sugar","quantity":"2 tbsp","additionalInstruction":null},{"name":"cornstarch","quantity":"2 tbsp","additionalInstruction":null},{"name":"egg yolks","quantity":"2","additionalInstruction":null},{"name":"whipping cream","quantity":"1 cup","additionalInstruction":null},{"name":"frozen puff pastry","quantity":"<sup>1</sup>&frasl;<sub>2</sub> package (397 g/14 oz)","additionalInstruction":null},{"name":"icing sugar","quantity":"3 tbsp","additionalInstruction":null},{"name":"warm water","quantity":"1 tbsp","additionalInstruction":null},{"name":"dark Belgian chocolate","quantity":"<sup>1</sup>&frasl;<sub>4</sub> cup","additionalInstruction":null}],"totalTime":"55 min","servings":"4 servings","preparation":["Heat milk and Vanilla Extract in Multipurpose Pot - 8 cup over medium heat until steamy, but not boiling. Remove from heat.","Whisk sugar and cornstarch in a medium mixing bowl. Whisk in yolks until well blended.","Slowly whisk milk mixture into egg mixture. Pour back into pot and return to heat. Stir constantly, until mixture thickens and coats the back of a spoon, 6–8 minutes. Do not boil. Pour into a clean bowl and refrigerate until chilled.","Whip cream until stiff peaks form. When custard is cool, gently fold in whipped cream.","Preheat oven to 375° F (190° C).","Line Sheet Pan with parchment paper. Roll out puff pastry on a lightly floured surface to 1&frasl;4” thickness. Cut into 8 squares and place on baking sheet. Chill for 10 minutes. Using the tines of a fork, prick several holes in pastry.","Cover pastry with another sheet of parchment paper and place another baking sheet on top to weigh down the pastry.","Bake for 10 minutes. Remove top baking sheet and parchment. Continue to bake for 15 minutes, or until golden brown. Set aside to cool.","Prepare glaze by whisking icing sugar and water until dissolved. Brush onto 4 of the 8 pastry squares.","Melt dark Belgian chocolate in a chocolate decorator. Draw 3 lines of chocolate horizontally across each of the 4 glazed pastry squares. Using a toothpick, draw a line through the chocolate creating a wavy decorative design.","When ready to serve, place 4 plain pastry squares on a serving platter.","Using a large spoon, dollop custard onto each square.","Cover with decorated lids and press down gently. Enjoy!"],"tags":[{"slug":"sheet_pan_3e5bebd","name":"Sheet Pan"},{"slug":"onion_free","name":"Onion-free"},{"slug":"garlic_free","name":"Garlic-free"},{"slug":"dessert","name":"Dessert"}],"nutritionalInformation":{"servingSize":"","calories":670,"fat":48,"saturatedFat":22,"transFat":0,"cholesterol":185,"sodium":180,"carbohydrate":51,"fiber":2,"sugars":24,"protein":9},"tips":["Creative Cooking: No puff pastry? No problem! Use graham crackers or gingersnaps instead.","Chef Tip: Traditional Napoleons have many layers of pastry and custard. Epicure’s version is a quickie shortcut with 2 layers. To make more layers, cut puff pastry into 16 smaller squares instead of 8. Thinly spread layers with custard and stack.","Preparation Tip: Epicure's Vanilla Custard can be replaced with store-bought vanilla pudding."],"perfectlyBalanceYourPlate":"","image":"1612478174248-recipeMainImagePath.jpg","products":[{"slug":"sheet_pan_423693c","name":"Sheet Pan","summary":["Lightweight all-purpose baking sheet made from a single piece of aluminum, with a one-inch rim.&nbsp;"]}]}