{"name":"\"Nice\" Cream","slug":"nice-cream","description":"","ingredients":[{"name":"frozen bananas","quantity":"6","additionalInstruction":null},{"name":"Summer Berry Sweet Dip Mix or Strawberry Margarita Mix","quantity":"1 tsp","additionalInstruction":null},{"name":"Power Up Vanilla Protein Blend","quantity":"2 scoops","additionalInstruction":null},{"name":"vanilla extract","quantity":"1 tsp","additionalInstruction":"optional"},{"name":"mixed frozen berries such as strawberries, cherries, raspberries, or blueberries","quantity":"4 cups","additionalInstruction":null}],"totalTime":"10 min","servings":"6 servings","preparation":["Cut peeled bananas into small pieces. Place in a food processor; add dip mix, protein blend, and vanilla, if desired.","Pulse until creamy, scraping down the sides as necessary. Turn into a bowl and stir in berries; freeze until ready to use. Serve with toppings, if desired."],"tags":[{"slug":"vegan","name":"Vegan"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"no_cook","name":"No-Cook"},{"slug":"dessert","name":"Dessert"}],"nutritionalInformation":{"servingSize":"","calories":190,"fat":1,"saturatedFat":0.3,"transFat":0,"cholesterol":0,"sodium":100,"carbohydrate":40,"fiber":7,"sugars":22,"protein":9},"tips":["Sandwich Nice Cream between waffles."],"perfectlyBalanceYourPlate":"","image":"Nice cream waffles-161.jpg","products":[{"slug":"summer_berry_sweet_dip_mix_3b74ec9","name":"Summer Berry Sweet Dip Mix","summary":["If you could capture sweet summer in a jar, this would be it. A tangy, fruity blend of raspberries, strawberries, hibiscus, and a touch of rooibos, Summer Berry works as a dip or seasoning for yogurt, oatmeal, smoothies, and more.&nbsp;"]},{"slug":"strawberry_margarita_mix","name":"Strawberry Margarita Mix","summary":["We can transport ourselves to the tropics whenever we want with our <strong>Strawberry Margarita Mix</strong>. With a sweet, tangy blend of real strawberries and tart lime juice, we can create restaurant-quality margaritas by blending with ice, strawberries (frozen or fresh), and water (tequila optional). This mix is also perfect for other fruity cocktails or mocktails. Made with high-quality, natural ingredients, it's a healthier alternative to traditional, sugary mixes.&nbsp;"]},{"slug":"power_up_vanilla_protein_blend__pouch_","name":"Power Up Vanilla Protein Blend (Pouch)","summary":["Fuel up first thing and stay fuller longer with rich smooth-tasting vanilla blend. Made with pea and fava bean protein, this blend turns into a velvety shake (just mix with water or milk) or morning smoothie with a luscious creamy texture, not chalky like a lot of other protein powders. It’s made with heat-stable probiotics which means baking with benefits! Add to pancake, waffle, muffin, or cookie batters. Power up your morning with an extra boost from 20 g of plant-based protein and essential amino acids.&nbsp;"]}]}