{"name":"Pizza Pasta Bake ","slug":"pizza-pasta-bake","description":"It's a saucy, cheesy mashup of your favourite pizza and pasta. Perfect for a fun family night in—easy to make and fun to eat! Include some of your family's fave pizza toppings at the dinner table; let them choose what to top their pasta with! Sliced black olives, diced bell peppers, mushrooms or even cooked, crumbled sausage.","ingredients":[{"name":"bite-size pasta","quantity":"1 lb (450 g)","additionalInstruction":"such as penne or rotini, about 4 cups"},{"name":"light cream cheese","quantity":"1 brick (8 oz/250 g)","additionalInstruction":"softened"},{"name":"light mayonnaise","quantity":"1 cup","additionalInstruction":null},{"name":"Pizza Dip Hot Dip Mix","quantity":"1 pkg","additionalInstruction":null},{"name":"shredded mozzarella cheese ","quantity":"1 cup","additionalInstruction":null},{"name":"pepperoni slices ","quantity":"14–16","additionalInstruction":null}],"totalTime":"25 min","servings":"8 servings","preparation":["Preheat oven to 400° F.","In a large pot, cook pasta according to package directions. Reserve 1&frasl;2 cup pasta water, then drain.","Meanwhile, in Sauté Pan, combine cream cheese, mayo, and hot dip mix. Cover; cook over medium-low heat, stirring frequently, until warm, about 6–7 min.","Add warm pasta and 1&frasl;4 cup reserved pasta water to pan; stir until combined. Add more pasta water 1 tbsp at a time as needed. Top with cheese and pepperoni.","Transfer pan to oven. Bake 6–8 min, or until cheese is melted. Add toppings, if desired."],"tags":[{"slug":"stovetop_978bc23","name":"Stovetop"},{"slug":"lunch","name":"Lunch"},{"slug":"epic_life_dinner","name":"Dinner"},{"slug":"epic_life_lunch","name":"Lunch"},{"slug":"dinner","name":"Dinner"},{"slug":"sugar_conscious","name":"Sugar Conscious"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"}],"nutritionalInformation":{"servingSize":"","calories":430,"fat":17,"saturatedFat":7,"transFat":0,"cholesterol":40,"sodium":560,"carbohydrate":52,"fiber":3,"sugars":6,"protein":15},"tips":["The Sauté Pan goes from stovetop to oven—if you don't have one, simply transfer the pasta and cream cheese mixture to an oven-proof dish, such as the Multipurpose Steamer. Top with pepperoni and cheese, then bake.","Swap 2 tbsp Pizza Seasoning or Marinara Sauce Mix for Pizza Dip Hot Dip Mix."],"perfectlyBalanceYourPlate":"Serve with 1 cup steamed broccoli or 2 cups spinach—choose higher protein veggies to bump up the protein.","image":"Pizza-Pasta-Bake-recipe_2160x1860.jpg","products":[{"slug":"pizza_dip_hot_dip_mix__pack_of_3__8d78419","name":"Pizza Dip Hot Dip Mix (Pack of 2)","summary":["Pizza is always a fave and this hot (in temperature) dip will make you a legend at your next get-together. Loaded with layers of cheesy goodness, it’s great served with tortilla chips and bread.&nbsp;"]},{"slug":"fry_pan_12_","name":"Sauté Pan","summary":["An all-purpose pan to brown, sauté, and simmer—ideal for one pan meals."]},{"slug":"marinara_sauce_mix_1b1cb1a","name":"Marinara Sauce Mix","summary":["A simple, kid-friendly sauce that speaks volumes, Marinara is packed with the bright flavor of garlic, oregano, and basil. Pair it with your fave pasta and use it as a base layer for delicious homemade pizza.&nbsp;&nbsp;"]},{"slug":"pizza_seasoning_2308099","name":"Pizza Seasoning (1002291)","summary":["In a world of complex gastronomy, pizza is a testament to the simple pleasures we all crave. Now you can get it by the spoonful! This blend delivers the nostalgic flavours and feeling of eating pizza, with notes of basil, oregano, garlic, tomato, and green bell peppers with loads of Parmesan. And yes, there is a mild whisper of chilli, too!&nbsp;&nbsp;"]},{"slug":"multipurpose_steamer_bd092c3","name":"Multipurpose Steamer","summary":["Like a casserole dish in design &amp; purpose, this cooking utensil is made of silicone &amp; has a 14-cup capacity."]}]}