{"name":"Pot Roast Pasta","slug":"pot-roast-pasta","description":"Prepare Slow-Cooked Saucy Pot Roast for dinner on Sunday and transform leftovers into a hearty pasta meal on busy weeknights. Enjoy the comfort of pasta, the rich, beefy flavours of pot roast, and the fragrant basil and garlic of the seasoning. Shake on some 3 Onion Dip Mix to add an extra element of savoury.","ingredients":[{"name":"pasta","quantity":"3 cups","additionalInstruction":"your choice"},{"name":"Bruschetta Seasoning or Marinara Sauce Mix","quantity":"1 tbsp","additionalInstruction":null},{"name":"Slow-cooked Saucy Pot Roast or Bolognese Sauce","quantity":"4 cups","additionalInstruction":null},{"name":"baby spinach or chopped kale","quantity":"4 cups","additionalInstruction":null}],"totalTime":"15 min","servings":"6 servings","preparation":["In Multipurpose Pot, cook pasta according to package directions. Drain and toss with dip mix. Move to bowl and cover to keep warm.","Heat sauce in pot. Stir in spinach until wilted, about 1 min. Add pasta back to pot and stir to evenly coat with sauce.","Divide into bowls and top with Parmesan, if desired."],"tags":[],"nutritionalInformation":{"servingSize":"","calories":440,"fat":11,"saturatedFat":4,"transFat":0.3,"cholesterol":70,"sodium":120,"carbohydrate":49,"fiber":6,"sugars":9,"protein":36},"tips":[],"perfectlyBalanceYourPlate":"Serve with 1 cup chopped veggies.","image":"Pot-Roast-Pasta-Main.jpg","products":[{"slug":"bruschetta_seasoning","name":"Bruschetta Seasoning","summary":["An aromatic blend of basil, garlic and parsley."]},{"slug":"marinara_sauce_mix_1b1cb1a","name":"Marinara Sauce Mix","summary":["A simple, kid-friendly sauce that speaks volumes, Marinara is packed with the bright flavor of garlic, oregano, and basil. Pair it with your fave pasta and use it as a base layer for delicious homemade pizza.&nbsp;&nbsp;"]},{"slug":"n3_onion_dip_mix_c845e80","name":"3 Onion Dip Mix","summary":["These onions won’t make you cry—they’re pure happiness in a jar! Save time (and tears) on chopping and use this blend anytime you’re looking for the robust flavour of onions, chives, and scallions. Take it way beyond the dip bowl and use 3 Onion as a sauce or seasoning for eggs, veggies, burgers, tacos, and more!&nbsp;"]}]}