{"name":"Roast Chicken Bone Broth","slug":"roast-chicken-bone-broth","description":"Bone broth is a nourishing food filled with nutrients and comforting flavour. The most important ingredients are roasted bones – a great way to use leftover roast chicken carcass. Slow cooking extracts all the nutrients (most notably, collagen) and proteins so they seep into the broth. Collagen supports good skin, hair and nail health. We love using an Instant Pot(tm) because it contains all the “aromas” and is faster than stovetop cooking.","ingredients":[{"name":"Rotisserie Chickens","quantity":"2","additionalInstruction":"leftover bones only"},{"name":"cold water","quantity":"8-10 cups","additionalInstruction":null},{"name":"apple cider vinegar","quantity":"3 tbsp","additionalInstruction":null},{"name":"Vegetable scraps","quantity":null,"additionalInstruction":"optional"},{"name":"Sea salt","quantity":null,"additionalInstruction":"to taste"}],"totalTime":"3 hours","servings":"8","preparation":["In an 8-quart programmable pressure cooker, place chicken bones, vinegar, and veggies, if using. Pour water overtop; do not let water reach above two-thirds full.","Secure lid; press ‘MANUAL” button, select “HIGH”, and set the timer to 120 min. Ensure the steam release handle is in “SEALING” position. This will take some time to get up to temperature before the timer starts to count down.","When cook time has finished, turn to ‘KEEP WARM” and let pressure release naturally for 30 min.","When cool enough to handle, strain broth; discard bones. If you added optional veggies, carefully from the strainer and place in a blender. Puree until smooth; add broth if needed. Stir into strained broth.Taste and add salt, if desired.","Allow broth to cool completely, then portion (as desired) and refrigerate up to 1 week or freeze up to 3 months. If freezing, be sure to leave space at the top of the container for broth to expand."],"tags":[],"nutritionalInformation":{"servingSize":"about 1 1/4 cups","calories":38,"fat":0,"saturatedFat":0,"transFat":0,"cholesterol":5,"sodium":300,"carbohydrate":0,"fiber":0,"sugars":0,"protein":5},"tips":["Save those leftover Rotisserie Chicken carcasses and vegetable prep scraps. Keep a bag in your freezer to save scraps until you have enough for a batch of broth. Butts of celery stalks, mushroom stems, ends of onions, and carrot trimmings are all excellent options to boost flavour.","Swap water for prepared Nourish or Vegetable Broth."],"perfectlyBalanceYourPlate":"","image":"bone_broth_1036x583.jpg","products":[{"slug":"nourish_broth_mix__reformulated_","name":"Nourish Broth Mix (reformulated)","summary":["Rich taste of slowly simmered chicken with garden-fresh flavours of onion, celery, and herbs. Just add water!"]},{"slug":"vegetable_broth_mix","name":"Vegetable Broth Mix","summary":["Make a tasty vegetable broth in a matter of seconds! Same garden-fresh flavor as making it from scratch—just add water!"]}]}