{"name":"Sylvie’s Easy Panna Cotta","slug":"sylvie-s-easy-panna-cotta","description":"","ingredients":[{"name":"cold water","quantity":"6 tbsp","additionalInstruction":null},{"name":"powdered gelatin","quantity":"2 pkg (<sup>1</sup>&frasl;<sub>4</sub> oz/ 7 g)","additionalInstruction":null},{"name":"35% whipping cream","quantity":"2 cups","additionalInstruction":null},{"name":"table cream or homogenized milk","quantity":"2 cups","additionalInstruction":null},{"name":"sugar","quantity":"<sup>1</sup>&frasl;<sub>2</sub> cup","additionalInstruction":null},{"name":"vanilla extract","quantity":"1 <sup>1</sup>&frasl;<sub>2</sub> tbsp","additionalInstruction":null}],"totalTime":"23 min","servings":"8 servings","preparation":["Place cold water in a large bowl and sprinkle gelatin overtop. Let stand 5–10 minutes.","Meanwhile, in a large measuring cup, stir creams together, then stir in sugar. Microwave on medium, stirring often, until sugar dissolves, about 5 minutes. Stir in vanilla.","Lightly brush 8 ramekins with vegetable oil (Note: If serving in cups or glasses, you don’t need to brush with oil). Pour warm cream mixture over gelatin. Stir until gelatin is completely dissolved.","Divide mixture between cups, then chill until firm, about 2 hours. To serve, run a knife around inside edge of each ramekin. Unmold on a plate and garnish with fresh berries, if you wish."],"tags":[{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"dessert","name":"Dessert"}],"nutritionalInformation":{"servingSize":"","calories":280,"fat":23,"saturatedFat":14,"transFat":0,"cholesterol":85,"sodium":55,"carbohydrate":14,"fiber":0,"sugars":14,"protein":5},"tips":["I use ramekins to make small portions and then unmold them just before serving. However, these look stunning served in tea or coffee cups, small wine glasses or martini glasses too.","Flavour Tips:   To make chocolate Panna Cotta: whisk 3–4 tbsp cocoa into cream mixture before heating.  Whisk well after heating to evenly blend. Continue with recipe as written. Garnish finished Panna Cottas’ with a dusting of Cocoa Powder.  To make tea-infused Panna Cotta: Steep 2 tbsp your favourite Epicure Tea in warm cream mixture for 5 minutes. Strain to remove solids and continue with recipe. Try Epicure’s Christmas Tea or Turmeric & Ginger Blend Tea.  To make spiced Panna Cotta: Whisk 1–2 tbsp Epicure’s Apple Pie Spice or Cinnamon.  To make sweet-savoury Panna Cotta: Whisk 1–2 tbsp pink peppercorns, 2–3 bay leaves, or try star anise, cinnamon sticks, black peppercorns, fennel, or anise seed and slices of fresh ginger, chopped strawberries or raspberries or zest from lemons, limes or oranges. Simply stir into cream mixture before heating. Stir well after heating, then strain and discard solids. Continue with recipe."],"perfectlyBalanceYourPlate":"","imagePath":"../images/1610727897369-recipeMainImagePath.jpg","products":[]}