{"name":"Tuna Mac & Cheese","slug":"tuna-mac-cheese","description":"Finally, mac & cheese with health benefits! This easy immune boosting recipe is something the whole family will love. Make it tonight!","ingredients":[{"name":"bite-sized pasta","quantity":"1 <sup>1</sup>&frasl;<sub>4</sub> cup","additionalInstruction":null},{"name":"fresh or frozen broccoli florets","quantity":"2 cups","additionalInstruction":null},{"name":"Mac & Cheese Seasoning","quantity":"1 pkg","additionalInstruction":null},{"name":"milk","quantity":"2 tbsp","additionalInstruction":null},{"name":"3 Onion Dip Mix","quantity":"1 tbsp","additionalInstruction":null},{"name":"CCB Dip Mix","quantity":"1 tbsp","additionalInstruction":null},{"name":"Lemon Dilly Dip Mix","quantity":"1 tbsp","additionalInstruction":null},{"name":"low-sodium light tuna","quantity":"1 can (5 oz/142 g)","additionalInstruction":null},{"name":"shredded low-fat cheese, divided","quantity":"1 cup","additionalInstruction":null}],"totalTime":"20 min","servings":"4 servings","preparation":["Preheat broiler to high.","Cook pasta in a Multipurpose Pot - 12 C according to package directions. Stir in broccoli for last 1 min of cooking. Drain.","Add seasoning, dip mixes, and milk. Stir to combine.","Mix in tuna and half the cheese.","Transfer to a casserole dish, top with remaining cheese, and broil until cheese melts, about 2 min."],"tags":[],"nutritionalInformation":{"servingSize":"","calories":300,"fat":7,"saturatedFat":3.5,"transFat":0,"cholesterol":30,"sodium":620,"carbohydrate":33,"fiber":1,"sugars":4,"protein":27},"tips":[],"perfectlyBalanceYourPlate":"Serve with 1 cup each mixed greens and chopped veggies, with 2 tsp Epicure salad dressing.","image":"Extraordinary-Tuna-Mac-&-Cheese-Bake_1036x583.jpg","products":[{"slug":"ccb_dip_mix_b61a530","name":"CCB Dip Mix","summary":["<strong>Cheese. Chives. Bacon. </strong>How's that for a totally irresistible trio? Our very own smoky vegetarian bacon, made from pinto beans, is the secret star of this oh-so-yummy dip.","This blend is all about versatility and we recommend taking it way beyond the dip bowl—use CCB in any dish that could use a little levelling up.&nbsp;","<br>"]},{"slug":"lemon_dilly_dip_mix_cefe2b4","name":"Lemon Dilly Dip Mix","summary":["Beyond being one of our most-loved kid-friendly dips – they love it for dunking chicken strips, fish bites, and veggies – Lemon Dilly is all about versatility. With loads of dill and a hint of lemon zest, it makes an utterly delicious tzatziki and spread for burgers and sandwiches, and levels up everything from salad dressing and salmon to pasta and vegetables.&nbsp;&nbsp;"]},{"slug":"mac___cheese_seasoning__pkg_of_3_","name":"Mac & Cheese Seasoning (Pack of 3)","summary":["An all-time best-seller, this is the Mac &amp; Cheese you’ve been craving – and that your kids will LOVE to eat! Creamy, cheesy, and super comforting, it’s free of unnecessary additives and packed with flavour thanks to real cheddar cheese. Take it from the stovetop (or microwave) to the table in under 10 minutes and dig in!&nbsp;&nbsp;"]},{"slug":"n3_onion_dip_mix_c845e80","name":"3 Onion Dip Mix","summary":["These onions won’t make you cry—they’re pure happiness in a jar! Save time (and tears) on chopping and use this blend anytime you’re looking for the robust flavour of onions, chives, and scallions. Take it way beyond the dip bowl and use 3 Onion as a sauce or seasoning for eggs, veggies, burgers, tacos, and more!&nbsp;"]}]}