{"name":"Ice Queen Birthday Cake","slug":"ice-queen-birthday-cake","description":"<p>Make it at home—don’t buy it from you-know-where! Customize with your favourite ice cream flavours and use the <a data-item-id=\"38e9c45d-465e-4a8b-8c16-5f437f361347\" href=\"\">Round Steamer</a> as mold to shape the cake. While it’s easy to make, this recipe does require time for the ice cream to first thaw, and then freeze in layers, so be sure to plan ahead and work in stages.</p>","ingredients":[{"name":"Chocolate Fudge Sauce","quantity":"1 pkg","additionalInstruction":null},{"name":"whipping cream","quantity":"1 cup","additionalInstruction":null},{"name":"frozen raspberries or blueberries","quantity":"2 cups","additionalInstruction":null},{"name":"container vanilla ice cream or frozen yogurt","quantity":"1.65 L","additionalInstruction":null},{"name":"container chocolate ice cream or frozen yogurt","quantity":"1.65 L","additionalInstruction":null},{"name":"whipping cream","quantity":"2 cups","additionalInstruction":null},{"name":"icing sugar","quantity":"1 cup","additionalInstruction":null},{"name":"vanilla extract","quantity":"1 tsp","additionalInstruction":null},{"name":"Tutti Fruity Whole Food Topper","quantity":null,"additionalInstruction":"to taste"}],"totalTime":"7 hrs (includes 6 hrs freeze time)","servings":"16 servings","preparation":"<ol>\n  <li>In a&nbsp;<a data-item-id=\"2b4f7526-f274-51dc-ab7f-e5330a71cfb2\" href=\"\">Multipurpose Pot</a>, whisk sauce mix with whipping cream. Bring to a boil. Reduce heat to medium-high and continue cooking for 3 min. Refrigerate until cold, then stir in berries.&nbsp;&nbsp;</li>\n  <li>Line&nbsp;<a data-item-id=\"38e9c45d-465e-4a8b-8c16-5f437f361347\" href=\"\">Round Steamer</a>&nbsp;with plastic wrap—you’ll need 2 large&nbsp;pieces&nbsp;so&nbsp;it&nbsp;covers the bottom and comes up and over the side.&nbsp;</li>\n  <li>About 20 min before using, set the vanilla ice cream on the counter to soften. Scoop into steamer; using the&nbsp;<a data-item-id=\"16ab865a-3c85-4092-971a-1bdf5e58b81b\" href=\"\">3-in-1 Spatula</a>,&nbsp;spread into an even layer. Top with chilled chocolate sauce. Freeze for 1 hr or until firm.&nbsp;</li>\n  <li>Meanwhile, set the chocolate ice cream out on the counter to soften. Once the vanilla layer is firm, spoon chocolate ice cream on top; spread into an even layer. Loosely cover with the overhanging plastic wrap. Gently tap steamer on counter a few times to help pack the layers. Freeze until very firm, at least 5 hrs or overnight.&nbsp;&nbsp;</li>\n  <li>For the topping, pour cream into a chilled bowl. Using an electric mixer, beat just until soft peaks start to form. Gradually beat in icing sugar, then vanilla,&nbsp;until stiff peaks form when beaters are lifted.&nbsp;</li>\n  <li>To decorate the cake, remove steamer from freezer and unwrap plastic; let the plastic wrap overhang on the outside of the steamer. Place a large plate on top of the steamer; carefully invert cake onto plate. Remove and discard plastic wrap.&nbsp;&nbsp;</li>\n  <li>Spread whipped cream all over top and sides of cake. If you wish, save some of the whipped cream and put in a piping bag; pipe a border around top of cake. Generously shake on topper. Cake will keep well frozen up to 3 days before serving.&nbsp;</li>\n</ol>","tags":[{"slug":"no_cook","name":"No-Cook"},{"slug":"dessert","name":"Dessert"},{"slug":"gluten_free_e8446d0","name":"Gluten-free"},{"slug":"mother_s_day","name":"Mother’s Day"},{"slug":"birthday","name":"Birthday"}],"nutritionalInformation":{"servingSize":"1 slice","calories":440,"fat":25,"saturatedFat":16,"transFat":0,"cholesterol":90,"sodium":110,"carbohydrate":49,"fiber":3,"sugars":42,"protein":6},"tips":"<p>Prep the Chocolate Fudge sauce 1–2 days before using, but don’t stir in the berries. Add them to the sauce just before assembling the cake.&nbsp;</p>\n<p>Before making the cake, ensure you have enough room in the freezer to hold the&nbsp;<a data-item-id=\"38e9c45d-465e-4a8b-8c16-5f437f361347\" href=\"\">Round Steamer</a>&nbsp; - you may have to move a few items around to make space.&nbsp;</p>","perfectlyBalanceYourPlate":""}